system/blockMeshDict
FoamFile
{
  version 2.0;
  format  ascii;
  class   dictionary;
  object  blockMeshDict;
}
vertices
(
  (-0.43 -0.36 -0.36)
  (1.13 -0.36 -0.36)
  (1.13 0.36 -0.36)
  (-0.43 0.36 -0.36)
  (-0.43 -0.36 0.36)
  (1.13 -0.36 0.36)
  (1.13 0.36 0.36)
  (-0.43 0.36 0.36)
);
blocks
(
  hex (0 1 2 3 4 5 6 7) (37 17 17) simpleGrading (1 1 1)
);
edges ();
patches ();
mergePatchPairs ();
