system/surfaceFeatureExtractDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
Cuboid.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs
    {
        includedAngle 165.0;
    }
    subsetFeatures
    {
        nonManifoldEdges no;
        openEdges yes;
    }
    writeObj yes;
}
model.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs
    {
        includedAngle 165.0;
    }
    subsetFeatures
    {
        nonManifoldEdges no;
        openEdges yes;
    }
    writeObj yes;
}
